**PANDAS PRACTICES**

Importing necesarry libraries to accomplish the tasks.

In [1]:
import numpy as np
import pandas as pd
from matplotlib import pyplot as plt
import seaborn as sns
import missingno as msno

1) Reading the dataframe called **"Titanic"**

In [2]:
df = sns.load_dataset('titanic')

In [3]:
print(df.head())

   survived  pclass     sex   age  sibsp  parch     fare embarked  class  \
0         0       3    male  22.0      1      0   7.2500        S  Third
1         1       1  female  38.0      1      0  71.2833        C  First
2         1       3  female  26.0      0      0   7.9250        S  Third
3         1       1  female  35.0      1      0  53.1000        S  First
4         0       3    male  35.0      0      0   8.0500        S  Third

     who  adult_male deck  embark_town alive  alone
0    man        True  NaN  Southampton    no  False
1  woman       False    C    Cherbourg   yes  False
2  woman       False  NaN  Southampton   yes   True
3  woman       False    C  Southampton   yes  False
4    man        True  NaN  Southampton    no   True

2) Finding out the male and female passengers from dataset

In [4]:
print(df['sex'].value_counts())

sex
male      577
female    314
Name: count, dtype: int64

3) Finding out the amount of unique values for each column

In [5]:
for column in df.columns:
    print(f"{column} has {df[column].nunique()} unique values")

survived has 2 unique values
pclass has 3 unique values
sex has 2 unique values
age has 88 unique values
sibsp has 7 unique values
parch has 7 unique values
fare has 248 unique values
embarked has 3 unique values
class has 3 unique values
who has 3 unique values
adult_male has 2 unique values
deck has 7 unique values
embark_town has 3 unique values
alive has 2 unique values
alone has 2 unique values

4) Finding out the unique values for **"pclass"** column

In [6]:
print(df['pclass'].unique())

[3 1 2]

In [7]:
print(df['pclass'].value_counts())

pclass
3    491
1    216
2    184
Name: count, dtype: int64

5) Finding the unique values for the **"pclass" and "parch"** columns

In [8]:
print(df[['pclass', 'parch']].nunique())

pclass    3
parch     7
dtype: int64

6) Check the **type of "embarked" column**. Change it to category and check the type of it again.

In [9]:
print(df['embarked'].dtype)

object

In [10]:
df = df.astype({'embarked': 'category'})

In [11]:
print(df['embarked'].dtype)

category

7) Print the rows that has **the embarked column is 'C'**.

In [12]:
print(df.loc[(df['embarked'] == 'C'), :])

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1           1       1  female  38.0      1      0  71.2833        C   First
9           1       2  female  14.0      1      0  30.0708        C  Second
19          1       3  female   NaN      0      0   7.2250        C   Third
26          0       3    male   NaN      0      0   7.2250        C   Third
30          0       1    male  40.0      0      0  27.7208        C   First
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
866         1       2  female  27.0      1      0  13.8583        C  Second
874         1       2  female  28.0      1      0  24.0000        C  Second
875         1       3  female  15.0      0      0   7.2250        C   Third
879         1       1  female  56.0      0      1  83.1583        C   First
889         1       1    male  26.0      0      0  30.0000        C   First

       who  adult_male deck embark_town alive  alone
1    woman       False    C   Cherbourg   yes  False
9    child       False  NaN   Cherbourg   yes  False
19   woman       False  NaN   Cherbourg   yes   True
26     man        True  NaN   Cherbourg    no   True
30     man        True  NaN   Cherbourg    no   True
..     ...         ...  ...         ...   ...    ...
866  woman       False  NaN   Cherbourg   yes  False
874  woman       False  NaN   Cherbourg   yes  False
875  child       False  NaN   Cherbourg   yes   True
879  woman       False    C   Cherbourg   yes  False
889    man        True    C   Cherbourg   yes   True

[168 rows x 15 columns]

8) Print the rows that **the embarked column is different than 'S'**.

In [13]:
print(df[df['embarked'] != 'S'])

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
1           1       1  female  38.0      1      0  71.2833        C   First
5           0       3    male   NaN      0      0   8.4583        Q   Third
9           1       2  female  14.0      1      0  30.0708        C  Second
16          0       3    male   2.0      4      1  29.1250        Q   Third
19          1       3  female   NaN      0      0   7.2250        C   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
875         1       3  female  15.0      0      0   7.2250        C   Third
879         1       1  female  56.0      0      1  83.1583        C   First
885         0       3  female  39.0      0      5  29.1250        Q   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck embark_town alive  alone
1    woman       False    C   Cherbourg   yes  False
5      man        True  NaN  Queenstown    no   True
9    child       False  NaN   Cherbourg   yes  False
16   child       False  NaN  Queenstown    no  False
19   woman       False  NaN   Cherbourg   yes   True
..     ...         ...  ...         ...   ...    ...
875  child       False  NaN   Cherbourg   yes   True
879  woman       False    C   Cherbourg   yes  False
885  woman       False  NaN  Queenstown    no  False
889    man        True    C   Cherbourg   yes   True
890    man        True  NaN  Queenstown    no   True

[247 rows x 15 columns]

9) Print the passengers that **their age is less than 30** and **their gender is female**.

In [14]:
print(df[(df['age'] < 30) & (df['sex'] == 'female')])

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
2           1       3  female  26.0      0      0   7.9250        S   Third
8           1       3  female  27.0      0      2  11.1333        S   Third
9           1       2  female  14.0      1      0  30.0708        C  Second
10          1       3  female   4.0      1      1  16.7000        S   Third
14          0       3  female  14.0      0      0   7.8542        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
874         1       2  female  28.0      1      0  24.0000        C  Second
875         1       3  female  15.0      0      0   7.2250        C   Third
880         1       2  female  25.0      0      1  26.0000        S  Second
882         0       3  female  22.0      0      0  10.5167        S   Third
887         1       1  female  19.0      0      0  30.0000        S   First

       who  adult_male deck  embark_town alive  alone
2    woman       False  NaN  Southampton   yes   True
8    woman       False  NaN  Southampton   yes  False
9    child       False  NaN    Cherbourg   yes  False
10   child       False    G  Southampton   yes  False
14   child       False  NaN  Southampton    no   True
..     ...         ...  ...          ...   ...    ...
874  woman       False  NaN    Cherbourg   yes  False
875  child       False  NaN    Cherbourg   yes   True
880  woman       False  NaN  Southampton   yes  False
882  woman       False  NaN  Southampton    no   True
887  woman       False    B  Southampton   yes   True

[147 rows x 15 columns]

10) Print the rows that has **the fare column is bigger than 500 or the age column is bigger than 70**.

In [15]:
print(df[(df['fare'] > 500) | (df['age'] > 70)])

     survived  pclass     sex   age  sibsp  parch      fare embarked  class  \
96          0       1    male  71.0      0      0   34.6542        C  First
116         0       3    male  70.5      0      0    7.7500        Q  Third
258         1       1  female  35.0      0      0  512.3292        C  First
493         0       1    male  71.0      0      0   49.5042        C  First
630         1       1    male  80.0      0      0   30.0000        S  First
679         1       1    male  36.0      0      1  512.3292        C  First
737         1       1    male  35.0      0      0  512.3292        C  First
851         0       3    male  74.0      0      0    7.7750        S  Third

       who  adult_male deck  embark_town alive  alone
96     man        True    A    Cherbourg    no   True
116    man        True  NaN   Queenstown    no   True
258  woman       False  NaN    Cherbourg   yes   True
493    man        True  NaN    Cherbourg    no   True
630    man        True    A  Southampton   yes   True
679    man        True    B    Cherbourg   yes  False
737    man        True    B    Cherbourg   yes   True
851    man        True  NaN  Southampton    no   True

11) Find out **empty values** for each column

In [16]:
for column in df.columns:
    print(f"{column} has {df[column].isnull().values.sum()} empty values.")

survived has 0 empty values.
pclass has 0 empty values.
sex has 0 empty values.
age has 177 empty values.
sibsp has 0 empty values.
parch has 0 empty values.
fare has 0 empty values.
embarked has 2 empty values.
class has 0 empty values.
who has 0 empty values.
adult_male has 0 empty values.
deck has 688 empty values.
embark_town has 2 empty values.
alive has 0 empty values.
alone has 0 empty values.

12) Remove the **"who" column** from the dataframe

In [17]:
df.drop(columns=["who"], inplace = True)

In [18]:
print(df.columns)

Index(['survived', 'pclass', 'sex', 'age', 'sibsp', 'parch', 'fare',
       'embarked', 'class', 'adult_male', 'deck', 'embark_town', 'alive',
       'alone'],
      dtype='object')

13) Find out the empty rows for 'deck' column and fill them with the most frequent value of the column.

In [41]:
df['deck'] = np.where(df['deck'].isnull(), df['deck'].mode(), df['deck'])

In [43]:
print(df['deck'].isnull().values.any())

False

14) Filling empty values for age variable with respect to the mean value of the age column

In [44]:
df['age'] = np.where(df['age'].isnull(), df['age'].mean(), df['age'])

In [45]:
print(df['age'].isnull().values.any())

False

15) Find the sum, count, and mean values for the survived variable, broken down by the pclass and gender variables.

In [46]:
print(df.groupby(['pclass', 'sex']).agg({'survived': ['mean', 'sum', 'count']}))

               survived
                   mean sum count
pclass sex
1      female  0.968085  91    94
       male    0.368852  45   122
2      female  0.921053  70    76
       male    0.157407  17   108
3      female  0.500000  72   144
       male    0.135447  47   347

16) Return 1 if age column is less than 30, else return 0. Create a new variable called **'age_flag'** and store it on the dataframe. **(use apply and lambda to accomplish the task correctly.)**

In [47]:
df['age_flag'] = df['age'].apply(lambda age: 0 if age > 30 else 1)

In [48]:
print(df[['age_flag', 'age']].head())

   age_flag   age
0         1  22.0
1         0  38.0
2         1  26.0
3         0  35.0
4         0  35.0